#### Terraform Format and Style `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.example_staging_vpc.aws_eip.ngw["eu-west-1b"][0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "ngw" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = "vpc"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m ipam_pool_id         = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m ptr_record           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.example_staging_vpc.aws_internet_gateway.public[0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "public" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-igw-eu-west-1"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-igw-eu-west-1"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # module.example_staging_vpc.aws_nat_gateway.private["eu-west-1b"][0m will be created
[0m  [32m+[0m[0m resource "aws_nat_gateway" "private" {
      [32m+[0m[0m allocation_id                      = (known after apply)
      [32m+[0m[0m association_id                     = (known after apply)
      [32m+[0m[0m connectivity_type                  = "public"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m network_interface_id               = (known after apply)
      [32m+[0m[0m private_ip                         = (known after apply)
      [32m+[0m[0m public_ip                          = (known after apply)
      [32m+[0m[0m secondary_private_ip_address_count = (known after apply)
      [32m+[0m[0m secondary_private_ip_addresses     = (known after apply)
      [32m+[0m[0m subnet_id                          = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "AZ"          = "eu-west-1b"
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-ngw-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "AZ"          = "eu-west-1b"
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-ngw-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
    }

[1m  # module.example_staging_vpc.aws_route_table.private["eu-west-1b"][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_block                 = "0.0.0.0/0"
              [32m+[0m[0m nat_gateway_id             = (known after apply)
                [90m# (11 unchanged attributes hidden)[0m[0m
            },
        ]
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "AZ"          = "eu-west-1b"
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-private-rt-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "AZ"          = "eu-west-1b"
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-private-rt-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.example_staging_vpc.aws_route_table.public[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_block                 = "0.0.0.0/0"
              [32m+[0m[0m gateway_id                 = (known after apply)
                [90m# (11 unchanged attributes hidden)[0m[0m
            },
        ]
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-public-rt"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-public-rt"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.example_staging_vpc.aws_route_table_association.private["10.0.4.0/24"][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.example_staging_vpc.aws_route_table_association.public["10.0.1.0/24"][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.example_staging_vpc.aws_subnet.private["10.0.4.0/24"][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.4.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "AZ"          = "eu-west-1b"
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-private-sn-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "AZ"          = "eu-west-1b"
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-private-sn-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.example_staging_vpc.aws_subnet.public["10.0.1.0/24"][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "AZ"          = "eu-west-1b"
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-public-sn-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "AZ"          = "eu-west-1b"
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-public-sn-eu-west-1b"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.example_staging_vpc.aws_vpc.webapp[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "webapp" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-vpc"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Application" = "enplat"
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "enplat-staging-vpc"
          [32m+[0m[0m "Region"      = "eu-west-1"
        }
    }

[1mPlan:[0m 10 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m nat_gateways    = {
      [32m+[0m[0m eu-west-1b = {
          [32m+[0m[0m az           = "eu-west-1b"
          [32m+[0m[0m private_cidr = "10.0.4.0/24"
          [32m+[0m[0m public_cidr  = "10.0.1.0/24"
        }
    }
  [32m+[0m[0m private_subnets = {
      [32m+[0m[0m "10.0.4.0/24" = {
          [32m+[0m[0m availability_zone       = "eu-west-1b"
          [32m+[0m[0m cidr                    = "10.0.4.0/24"
          [32m+[0m[0m map_public_ip_on_launch = [90mnull[0m[0m
          [32m+[0m[0m tags                    = {
              [32m+[0m[0m Type = "private"
            }
        }
    }
  [32m+[0m[0m public_subnets  = {
      [32m+[0m[0m "10.0.1.0/24" = {
          [32m+[0m[0m availability_zone       = "eu-west-1b"
          [32m+[0m[0m cidr                    = "10.0.1.0/24"
          [32m+[0m[0m map_public_ip_on_launch = true
          [32m+[0m[0m tags                    = [90mnull[0m[0m
        }
    }
  [32m+[0m[0m vpc_id          = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pushed by: @ridasaleemsage, Action: `pull_request`*